package lt.jsj.qust.jjlin;

/**
 * Created by adamin on 2014/12/13.
 */
public class Constant {
    public  static final String test="<html><head><title align='center'>【JJ名片】</title></head><body><body></html>";
    public static  final String prifile="<body bgcolor=\"pink\"><p><span style=\"font-size:32px;\"> <span style=\"font-family:Microsoft YaHei;\"> 【JJ名片】 </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:32px;\"> </span> &nbsp; </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> </span> <span style=\"font-size:16px;\"> <span style=\"font-family:Microsoft YaHei;\"> ❤林俊杰❤JJ Lin❤Lam JJ❤ </span> </span></p> \n" +
            "      <p><span style=\"font-size:16px;\"> </span> &nbsp;</p> \n" +
            "      <p><span style=\"font-size:16px;\"> <span style=\"font-family:Microsoft YaHei;\"> 国籍：新加坡 </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 出生日期：1981年3月27日（农历二月廿二） </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 生肖：鸡 </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 星座：白羊座 </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 血型：O型 </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 身高：172cm </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;\"> <span style=\"font-size:16px;\"> 体重：60kg </span> </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;font-size:18px;\"> 宗教信仰：基督教 </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;font-size:18px;\"> 喜欢的食物：醉虾、白饭、生鱼片 </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;font-size:18px;\"> 喜欢的颜色：深蓝、黑、白 </span></p> \n" +
            "      <p><span style=\"font-family:Microsoft YaHei;font-size:18px;\"> 偶像：Michael Jackson </span></p> \n" +
            "      <p><span style=\"font-size:16px;\"> </span> &nbsp;</p> \n" +
            "      <p><span style=\"font-size:16px;\"> <span style=\"font-family:Microsoft YaHei;\"> </span> </span></p> \n" +
            "      <p>林俊杰（JJ Lin），著名男歌手，1981年出生于新加坡。2003年首发第一张个人创作专辑《乐行者》，取得不俗成绩；其杰出的创作才能又在之后推出的《江南》（即《第二天堂》）、《编号89757》、《曹操》、《西界》、《JJ陆》《JJ林俊杰_100 天》、《她说》专辑中得以充分展现；他也为许多华语歌坛的歌手创作了很多作品，例如张惠妹的《记得》、王心凌的《当你》、Twins的《我很想爱他》等。林俊杰在2006年客串演出偶像剧《花样少年少女》，2008年担任男主角演出偶像剧《原来我不帅》。2008年，林俊杰亦成立了其个人音乐公司JFJ Productions，2009年创立潮流品牌SMUDGE。</p> \n" +
            "      <p>于此同时，林俊杰还斩获了无数音乐大奖，他那“镶嵌”着一对可爱的小酒窝的面孔、卓越的音乐创作才华以及具有亲和力、感染力、穿透力的磁性嗓音使他成为当今华语歌坛最耀眼的男歌手之一。其所有唱片总销量在全亚洲已超过1000万张，2011年8月8日携手华纳，迈出世界。" +
            "      <p>&nbsp;</p> \n" +
            "      <p><strong> 电视剧 </strong></p> \n" +
            "      <p>主要演出：庄俊维(小庄)（第1次担任男主角）（原来我不帅，2008年）</p> \n" +
            "      <p>客串演出：卢静希（饰演女主角瑞莃的哥哥）（花样少年少女第4、5集，2006年）</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><strong> 实验电影 </strong></p> \n" +
            "      <p>《杀手》（领衔主演：林俊杰、杨俐思（Liz），导演：比尔贾，片长：25分钟，2007年）</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><strong> 代言 </strong></p> \n" +
            "      <p><strong> 国际品牌 </strong></p> \n" +
            "      <p>2006－2010年：「雪碧」（sprite）商品代言</p> \n" +
            "      <p>2007年：「乐事薯片」（lays）商品代言</p> \n" +
            "      <p>2009年：「麦当劳」（MCDonald）商品代言</p> \n" +
            "      <p><strong> 在线游戏 </strong></p> \n" +
            "      <p>2004年：天堂&nbsp;II&nbsp;，代言歌曲：《第二天堂》</p> \n" +
            "      <p>2005年：EQ II&nbsp;东方版，代言歌曲：《无尽的思念》</p> \n" +
            "      <p>2008年：赤壁&nbsp;Online，代言歌曲：《醉赤壁》</p> \n" +
            "      <p>2010年：完美国际2012，代言歌曲：《完美新世界》</p> \n" +
            "      <p><strong> 台湾 </strong></p> \n" +
            "      <p>2007年：悦氏健茶到油切绿茶广告</p> \n" +
            "      <p>2007年：台湾管制药品管理局反毒大使</p> \n" +
            "      <p>2008年：六福村主题乐园</p> \n" +
            "      <p>2010年：点燃生命之火公益活动</p> \n" +
            "      <p>2011年：义大世界</p> \n" +
            "      <p><strong> 中国 </strong></p> \n" +
            "      <p>服饰：拜丽德休闲服（2007、2008）／奇安达休闲运动鞋（2007－2009）／大赢家休闲服饰</p> \n" +
            "      <p>饮料：纯中纯饮料代言／银露花生牛奶（2010）</p> \n" +
            "      <p>食品：「和路雪」（Cornetto）可爱多冰淇淋广告（2007－2009）</p> \n" +
            "      <p>电信：中国联通（2006）</p> \n" +
            "      <p>手机：韩国三星（2008）新加坡</p> \n" +
            "      <p>2006年：新加坡旅游局《非常新加坡》旅游大使</p> \n" +
            "      <p>2006年：全国推动讲华语运动大使</p> \n" +
            "      <p>2007年：新传媒电视台《U频道》</p> \n" +
            "      <p><strong> 马来西亚 </strong></p> \n" +
            "      <p>2007年：西尔康《CELCOM》电讯公司代言X-PAX／Super&nbsp;咖啡（2010）</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><strong> 历年记事 </strong></p> \n" +
            "      <p><em> <u> 1996年： </u> </em></p> \n" +
            "      <p>参加银座广场歌唱比赛</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 1997年： </u> </em></p> \n" +
            "      <p>参加第一届「滚石音乐词曲创作比赛」获歌唱组亚军</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 1998年： </u> </em></p> \n" +
            "      <p>参加新加坡电视机构「宜康卡拉OK歌唱比赛」获亚军</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 1999年： </u> </em></p> \n" +
            "      <p>参加海蝶音乐举办第二届「非常歌手训练班」毕业</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2002年： </u> </em></p> \n" +
            "      <p>成为阿杜新加坡巡回校园演唱会嘉宾</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2003年： </u> </em></p> \n" +
            "      <p>获HITO流行音乐奖</p> \n" +
            "      <p>获新加坡YES933醉心频道年度总结十大最受欢迎男歌手第二名</p> \n" +
            "      <p>9月6日：荣获新加坡金曲奖最佳新人金奖</p> \n" +
            "      <p>11月2日：入围马来西亚第三届金曲红人颁奖典礼最有潜质新人奖</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2004年： </u> </em></p> \n" +
            "      <p>2月12日：获全球华人明星人气榜第51名</p> \n" +
            "      <p>2月16日：获百事音乐风云榜提名港台、海外华人最佳新人</p> \n" +
            "      <p>2月21日：获HITO流行音乐奖声猛新人男新人奖</p> \n" +
            "      <p>5月9日：成为台湾第15届金曲奖、最佳新人奖得主</p> \n" +
            "      <p>9月4日：第四届全球华语歌曲排行榜颁奖典礼凭《江南》夺得年度二十首金曲之一</p> \n" +
            "      <p>10月15日：中国原创歌曲奖，港台最受欢迎男歌手、海外最佳创作人奖、最佳编曲《第二天堂》、最佳制作奖</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2005年： </u> </em></p> \n" +
            "      <p>凭《第二天堂》《江南》一曲获提名台湾第16届金曲奖、最佳作曲人奖</p> \n" +
            "      <p>9月3日，第五届全球华语歌曲排行榜颁奖典礼凭《一千年以后》夺得年度二十首金曲之一、最佳专辑《编号89757》、最受欢迎创作歌手及最佳杰出艺人（新加坡）</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p>2006年：</p> \n" +
            "      <p>举行《2006就是俊杰Just JJ-世界巡回现场会》，包括上海、新加坡、马来西亚、武汉、天津和台湾</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2007年： </u> </em></p> \n" +
            "      <p>成立个人音乐品牌制作公司-JFJ(J For J) Productions</p> \n" +
            "      <p>首度获提名台湾第18届金曲奖、最佳国语男歌手奖</p> \n" +
            "      <p>《2006就是俊杰Just JJ-世界巡回现场会》，去年六月在上海拉开了序幕，2007年再度回到上海，是最后的口碑加场，并加入《西界》专辑的新歌与新舞蹈，巡回现场会在上海画下完美句点</p> \n" +
            "      <p>2007年7月，专辑《西界》天津签售会成功挑战金氏世界纪录，《西界》专辑在天津一场签名会，2个半小时内签完3027张专辑，打破之前墨西哥歌手8小时签完2825张专辑的世界纪录，林俊杰平均不到3秒就签完1个名，签出金氏世界纪录。</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2008年： </u> </em></p> \n" +
            "      <p>1月：推出林俊杰首部电视偶像剧戏剧演出：《原来我不帅》。</p> \n" +
            "      <p>2月：宣布成立&nbsp;JJ Federation（林俊杰国际歌迷会「杰」联邦）以凝结各地不同的歌迷组织。</p> \n" +
            "      <p>4月起：参与一系列北京2008奥运助威宣传活动。</p> \n" +
            "      <p>5月14日：为四川震灾创作《爱与希望》并投入赈灾。</p> \n" +
            "      <p><strong> 8月8日：北京奥运三星火炬手，是唯一的海外华人火炬手。 </strong></p> \n" +
            "      <p>8月17日：印度尼西亚演唱会：【延续，爱与希望】。</p> \n" +
            "      <p>10月30日 台北葛福临福音节庆：【神让我生命是晴天】。</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2009年： </u> </em></p> \n" +
            "      <p>3月13日：林俊杰个人品牌SMUDGE新加坡旗舰店开幕，同时SMG网站正式启动 <a href=\"http://www.smudgestore.com/\"> http://www.smudgestore.com/ </a></p> \n" +
            "      <p>3月15日：新城唱好极品好男声音乐会(与方大同.曹格)</p> \n" +
            "      <p>3月28日：新加坡2009林俊杰「由你选择」世界巡回演唱会，JJ WORLD TOUR 2009&nbsp;的第一站。（特别嘉宾：BY2、范玮琪）</p> \n" +
            "      <p>4月6日：受邀参加新加坡第一届总统命令演出的表演</p> \n" +
            "      <p>6月20日：北京2009林俊杰「杰伴2009」世界巡回演唱会。（特别嘉宾：BY2、李宇春）</p> \n" +
            "      <p>7月12日：获新加坡杰出青年奖，是继何耀珊、孙燕姿后，第三位获此殊荣的新加坡音乐人</p> \n" +
            "      <p>12月26日：受邀担任建国中学舞会嘉宾</p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2010年： </u> </em></p> \n" +
            "      <p>1月15日：受邀担任「江若琳MY FIRST SHOW 2010香港演唱会」嘉宾</p> \n" +
            "      <p>1月21日：MTV LIVE SHOW -林俊杰&amp;胡彦斌</p> \n" +
            "      <p>1月30日 受邀担任NARS 15x15摄影比赛发表会评审</p> \n" +
            "      <p>2月2日：受邀参加2010花莲太平洋国际观光节演出</p> \n" +
            "      <p>2月13日：于新加坡新春特别节目「2010普天同庆金虎年」担任来宾</p> \n" +
            "      <p>2月18日：受邀参加aec Mid Autumm中秋晚会演出</p> \n" +
            "      <p>2月28日：与张靓颖在江苏卫视「雪碧中国原创音乐流行榜」合唱</p> \n" +
            "      <p>3月7日：于台南/台北各举行一场打烊音乐会</p> \n" +
            "      <p>3月26日：在《JJ林俊杰_一百天》发行100天后，于台湾华山艺文中心，举办《JJ Music Party》</p> \n" +
            "      <p>3月28日：JJ Party4(背对背拥抱拍照会)@新加坡</p> \n" +
            "      <p>4月3日：受邀参加2010垦丁春浪音乐节演出</p> \n" +
            "      <p>4月8日：受邀参加北京NOKIA「乐随想」演唱会</p> \n" +
            "      <p>4月15日：参加GUCCI慈善晚宴</p> \n" +
            "      <p>4月17日：雪碧青岛见面会</p> \n" +
            "      <p>4月24日：JJ WORLD TOUR 2010&nbsp;墨尔本演唱会</p> \n" +
            "      <p>4月25日：受邀担任新加坡红心颁奖典礼演唱嘉宾</p> \n" +
            "      <p>5月29日：2010 VZW APAHM Tour(美国洛杉矶演唱会)-林俊杰JJ Lin/许慧欣Evonne Hsu/吴建豪Vanness Wu/Mike Relm</p> \n" +
            "      <p>6月26日：入围第21届金曲奖，最佳国语男歌手奖 并受邀担任表演嘉宾</p> \n" +
            "      <p>「她说」专辑全亚洲破50万</p> \n" +
            "      <p><strong> 8月14日：担任新加坡青奥委会的火炬手 </strong></p> \n" +
            "      <p>&nbsp;</p> \n" +
            "      <p><em> <u> 2011年： </u> </em></p> \n" +
            "      <p>4月1日：台北小巨蛋I AM世界巡回演唱会，邀请五月天的阿信和王彩桦为嘉宾</p> \n" +
            "      <p>4月2日：台北小巨蛋I AM世界巡回演唱会，邀请郭静和萧亚轩为嘉宾</p> \n" +
            "      <p>4月9日：受邀参加第一届全球流行音乐金榜演出（于台北小巨蛋举行），并荣获年度最佳制作人（《她说》专辑）、年度最佳创作歌手、新加坡电台1003推崇大奖、年度20大金曲（《第几个100天》）</p> \n" +
            "      <p>6月18日：入围第22届金曲奖最佳国语男歌手奖</p> \n" +
            "      <p>8月8日：正式签约加入华纳唱片公司</p> \n" +
            "      <p>&nbsp;</p> </body>" ;
    public  static String rongyu="<div class=\"item\"> <h4 class=\"title\">荣誉记录</h4><div class=\"content\"><p>2009年4月8日，受邀参加为祝贺新加坡总统星光慈善圆满10周年的“总统嘉勉荣誉表演”，接受总统的直接肯定。</p><p>7月5日，获得由新加坡总统亲自颁发的新加坡杰出青年奖。</p><p>2008年4月30日，受邀参加北京奥运会倒计时100天庆典活动。</p><p>8月6日，林俊杰作为海外唯一艺人在天安门广场传递奥运火炬，火炬接力手编号149。8月8日受邀参加奥运会开幕仪式。</p><p>2009年10月13日，参与迎世博倒计时200天世博优秀歌曲演唱会。</p><p>2010年4月19日，出席上海世博会新加坡馆主题曲《感动每一刻》音乐电视首播新闻发布会。</p><p>8月5日，出席广州亚运会倒计时100天庆典晚会。</p><p>8月13日，以青少大使的身份参与首届青奥会火炬传递，从匈牙利总统施密特手中接过青奥会火炬。</p><p>2008年5月12日，汶川大地震发生，林俊杰用两天一夜创作《爱与希望》，成为赈灾歌曲创作第一人，随后共参加数十场赈灾义演帮助募集善款。多次到灾区实地探访，看望医院受伤的灾民，个人累计捐款过百万，此外还有多次物资捐赠。因地震后的爱心善举，中国邮政总公司特地将其肖像载入了“演艺界爱心捐助纪念典藏邮票册”，发行其个人邮票纪念册。</p><p>8月6日，林俊杰作为唯一海外艺人在天安门广场传递奥运火炬，火炬接力手编号149。8月8日受邀参加奥运会开幕仪式。</p><p>12月，马来西亚《JJ陆》慈善签唱会，收入全部捐给马来西亚砂捞越精神保健协会。</p><p>2009年透过教会社团认养了一名4岁的菲律宾小孩。</p><p>8月13日，台湾88水灾公益合辑《信心地图》感恩赈灾活动，现场捐100万。</p><p>8月31日，出席香港“太阳计划”闭幕式呼吁环保。</p><p>11月2日，出席由可口可乐、普莱尔基金会以及中国预防性病艾滋病基金会联合举办的“盖瑞·普莱尔慈善高尔夫邀请赛暨慈善拍卖晚宴”，现场助拍助拍迈克尔杰克逊签名照片和一张限量版唱片以及一副银色手套。</p><p>2010年1月，担任搜狐“公益Easy Go”活动推广大使，推广“新年新希望，帮助山区孩子多读一年书”公益主题。</p><p>2月，实地探访88水灾中受创严重的原住民部落，赠送文具礼物给台湾省屏东县青叶国小，并将宣传服拍卖所得全数捐出。</p><p>4月10日，将澳洲墨尔本个人演唱会门票利润的一半捐给西南干旱灾区。</p><p>11月1日，出席由可口可乐、普莱尔基金会以及中国预防性病艾滋病基金会联合举办的“盖瑞·普莱尔慈善高尔夫邀请赛暨慈善拍卖晚宴”，95万拍得郎朗钢琴课，现场拍卖打歌服，资助艾滋儿童。</p><p>2011年1月，探访台南竹埔国小，看望偏远山区小孩，捐赠书本文具等。</p><p>5月3日，受邀参加温哥华“Heart 2 Heart”慈善晚会。</p><p>7月7日 受邀参加“Kiehl's科颜氏 爱·循环慈善计划”亲自设计公益面膜包装，全部收益所得捐赠给“中华环境保护基金会”生态长城项目。</p><p>8月15日，出席深圳大运村“绿色大运”环保日活动，宣传环保理念。</p><p>11月，出席由可口可乐、普莱尔基金会以及中国预防性病艾滋病基金会联合举办的“盖瑞·普莱尔慈善高尔夫邀请赛暨慈善拍卖晚宴”，32万从陈奕迅手中拍得The Beatles的御用吉他。</p><p>2012年8月18日，参加由可口可乐主办的上海雪碧明星篮球慈善表演赛，当晚门票的全部收入人民币2，621，105.99元悉数捐赠给了中国青少年发展基金会，用于资助希望小学改善篮球运动设施并普及篮球运动。</p><p>9月16日，应可口可乐集团以及中国预防艾滋病基金会的邀请，亲自前往新疆喀什探访艾滋孤儿（探访请求于2011年慈善晚宴由林俊杰主动提出）。</p><p>10月29日，出席由可口可乐、普莱尔基金会以及中国预防性病艾滋病基金会联合举办的“盖瑞·普莱尔慈善高尔夫邀请赛暨慈善拍卖晚宴”。年底赴洛杉矶制作专辑时，以18万美金在已故巨星迈克尔·杰克逊的慈善拍卖会上抢标到1件黑皮衣。</p><p>2013年5月14日，出席香港“Kiehl's - Be the Ultimate Men” 慈善相展开幕活动，所募善款将捐献给由萧芳芳创立的“护苗基金”。</p><p>2009年5月4日，出席意大利知名时尚运动品牌Kappa与内地首席潮流媒体《YOHO！潮流志》举办的Kappa-YOHO潮流盛典开幕式。</p><p>9月4日，出席Swatch MTV Playground创意大赛中国赛区决赛盛典。</p><p>11月19日，出席2009年潮流盛典颁奖典礼，获颁“年度潮流价值人物”、“年度潮牌掌柜”。</p><p>2010年4月13日，GUCCI创作总监首访新加坡，林俊杰受邀参加慈善晚宴。</p><p>2012年9月8日，获国际时尚精品之邀参加一年一度的纽约时装周，更获邀与adidas集团时尚部门创意总监Dirk Schonberger进行面对面交流。</p><p>2006年3月27日，与新加坡旅游局签署合作协议，担任新加坡旅游形象大使。</p><p>2007年6月27日，受台湾卫生署邀请担任台湾反吸毒大使。</p><p>2009年6月5日，出任中国扶贫基金会“母婴平安120”行动项目爱心大使。</p><p>2010年12月17日，出席红十字慈善活动，担任台湾地区单亲家庭关怀大使。</p><p>2011年7月17日，担任奥比斯青年大使，为弱势眼疾孩童提供援助。</p><p>2012年2月10日，担任第54届葛莱美颁奖典礼宣传大使。</p><p>2013年3月5日, 受邀担任台湾“世界地球日-为地球而跑”活动环保大使。</p><p>2013年6月26日，受邀担任台湾“弱势学童长假营养厨房计划”爱心大使。</p><p>2014年3月27日，荣获QQ音乐年度盛典年度最佳港台男歌手；专辑《因你而在》荣获年度最佳国语专辑。</p></div></div>";
    public  static  String congye="<div class=\"item\"> <h4 class=\"title\">从艺历程</h4><div class=\"content\"><p>2003年集创作、演唱、舞蹈为一身，发行首张全创作专辑《乐行者》，在偶像当道的全盛时期大胆入局。虽然时逢SARS，但他和团队不轻言放弃，在3个月内走遍26个城市，进行了上百场演出，奠定了之后在中国大陆无懈可击的稳固基础。</p><p>  2004年游走大陆，让从小接受英语教育的林俊杰，首次体验中华文化所带来的冲击，结合西方R＆B现代曲风以及中国风的《江南》（台版《第二天堂》）由此诞生，红遍亚洲；同年，更凭借《乐行者》，拿下第15届台湾金曲奖最佳新人奖，事业起飞。</p><p>  2005年开始享有更大的音乐空间，《编号89757》穿梭在未来世界与古文明之间，发行后再度缔造经典高峰，横扫各大颁奖典礼的重大奖项。</p><p>  2006年1月28日，登上中国中央电视台春节联欢晚会（央视春晚）舞台献唱《一千年以后》，并以33.3%的支持率成为当晚最受观众喜爱的明星；</p><p>  2月1日，推出《曹操》，掀起一股东方摇滚风；</p><p>  同年，首次举办个人巡回演唱会，这不仅是个里程碑，也让更多人看到了他的歌唱实力与舞台魅力。</p><p>  2007年成立个人音乐制作公司JFJ；以人性的善恶纠结为基础，大胆推出更具突破性的《西界》；首度参演电视剧，客串出演台湾偶像剧《花样少男少女》。</p><p>  2008年首次主演网络小说改编的偶像剧《原来我不帅》；同年10月18日，发行具有最多“合作元素”的专辑《JJ陆》，《不潮不用花钱》掀起“叩叩”舞蹈潮流，与蔡卓妍合唱的《小酒窝》更是风靡歌坛，被誉为最经典的合唱曲目之一，也让他成功在香港市场占有一席之地。</p><p>  2009年3月28日，第二轮世界巡回演唱会【杰伴2009】于新加坡开启；随后，林俊杰遭受出道以来最严重的生理打击，几近失声，陷入低潮，演艺活动被迫中止；</p><p>  12月15日，携《100天》回归歌坛，这本纪录了低潮期的心情日记，体现了心境的转变，首首触动人心。</p><p>  2010年凭借《100天》入围第21届台湾金曲奖最佳男歌手，在颁奖典礼上的“金曲！！”表演，让百万观众见证林俊杰“诉说女人故事”的实力与魅力，使其在台湾的事业攀上了新的高峰；</p><p>  8月21日，于北京开启第三轮世界巡回演唱会【I AM】，用歌声诠释生命的意义，感受世界的真实，传递音乐的感动，It's when I'm weak that I am strong：我脆弱，却不退缩；</p><p>  2月8日，发行概念自选集《她说》，从曾经写给众多女歌手的近百首创作里精选出10首，重新改编，赋予全新生命，而新曲《她说》又缔造了一个新的经典。</p><p>    2011年二度登上台北小巨蛋，反响热烈，被媒体封为“新四大天王”之一；</p><p>  8月8日，加盟华纳音乐，开启新乐章；</p><p>  12月31日，推出加盟后首张创作专辑《学不会》，以近乎赤裸的全心演绎，感动千万听众。</p><p>  2012年推出首本个人故事影像集《记得》，跻身畅销作家行列；凭借《学不会》斩获各大奖项，深拓台湾市场，巩固华语乐坛天王地位。</p><p>  2013年3月13日，推出第十张全创作专辑《因你 而在》，通过十支MV十支微电影，以音乐与影像结合的方式，记录“十年有成，光荣十刻”。专辑一经发行即拿下27个榜单冠军，并以83.35%的高百分比刷新五大唱片单周销售百分比纪录，气势如虹；</p><p>  7月13、14日，于台北小巨蛋开启全新世界巡回演唱会【时线Time Line】，“用三千六百五十个日子，将时间的轨迹连成线，在时线之间，在实现之前，定义我们的不是时间，而是爱过的那些”。</p><p>2014年，2月16日，“时线TimeLine世界巡回演唱会”登陆伦敦，林俊杰也成为首位在伦敦开个唱的新加坡歌手；首度以制作人身份为歌手陈奕迅制作国语专辑《米·闪》中《闪》的部分，大获好评；6月28日，荣获第25届台湾金曲奖最佳国语男歌手奖，评审团以“拥有全方位创作、演唱、舞蹈实力，是实力派与偶像派的完美结合。兼具明星特质和演唱实力，诠释的细腻度和音乐掌控功力精湛，在音色展现上无可挑剔，唱功不容置疑”的评价对其进行全方位肯定，同时林俊杰也成为新加坡首位金曲歌王；7月18日，推出首张英文翻唱iTunes Session EP，亲自挑选曲目并与11位乐手同步Live录音，仅花4小时就全数录制完成，“金曲歌王”完美唱功展露无遗。</p></div></div>";
    public static  String  ziliao="<div class=\"item\" style=\"display:;\"><h3 class=\"title\">TA的基本档案</h3><div class=\"content\" style=\"display:;\"><ul><li class=\"bg\">中文名： 林俊杰</li><li class=\"bg\" title=\"外文名： JJ Lin，Wayne Lin，Aam JJ\">外文名： JJ Lin，Wayne Lin，Aam JJ</li><li class=\"\">国籍： 新加坡</li><li class=\"\">民族： 汉</li><li class=\"bg\">出生地： 新加坡</li><li class=\"bg\" title=\"出生日期： 1981年3月27日（农历二月廿二）\">出生日期： 1981年3月27日（农历二月廿二）</li><li class=\"\">职业： 歌手、演员、音乐制作人</li><li class=\"\" title=\"毕业院校： St Andrews Junior College\">毕业院校： St Andrews Junior College</li><li class=\"bg\">经纪公司： 华纳唱片</li><li class=\"bg\" title=\"代表作品： 《江南》、《曹操》、《发现爱》、《编号89757》等\">代表作品： 《江南》、《曹操》、《发现爱》、《编号89757》等</li><li class=\"\" title=\"主要成就： 新加坡杰出青年 第25届台湾金曲奖最佳国语男歌手 第15届台湾金曲奖最佳新人 25项中国原创音乐流行榜大奖 22项全球华语歌曲排行榜大奖 22项中国TOP排行榜大奖 19项台湾Hito流行音乐大奖 15项新加坡词曲版权协会大奖\">主要成就： 新加坡杰出青年 第25届台湾金曲奖最佳国语男歌手 第15届台湾金曲奖最佳新人 25项中国原创音乐流行榜大奖 22项全球华语歌曲排行榜大奖 22项中国TOP排行榜大奖 19项台湾Hito流行音乐大奖 15项新加坡词曲版权协会大奖</li><li class=\"\">生肖： 鸡</li><li class=\"bg\">星座： 白羊座</li><li class=\"bg\">血型： O型</li><li class=\"\">身高： 173cm</li><li class=\"\">体重： 60kg</li><li class=\"bg\" title=\"新浪微博： http://t.sina.com.cn/jjlin\">新浪微博： http://t.sina.com.cn/jjlin</li><li class=\"bg\" title=\"个人官方博客： http://www.jjfusion.com/\">个人官方博客： http://www.jjfusion.com/</li><li class=\"\" title=\"腾讯博客： http://user.qzone.qq.com/622009225/\">腾讯博客： http://user.qzone.qq.com/622009225/</li><li class=\"\" title=\"搜狐博客： http://linjunjievip.blog.sohu.com/\">搜狐博客： http://linjunjievip.blog.sohu.com/</li><li class=\"bg\" title=\"新浪博客： http://blog.sina.com.cn/linjunjie/\">新浪博客： http://blog.sina.com.cn/linjunjie/</li><li class=\"bg\">口头禅： 还好还好</li><li class=\"\">喜欢的科目： 美术、文学</li><li class=\"\">不擅长的科目： 数学</li><li class=\"bg\">掌握的语言： 英语、华语</li><li class=\"bg\">喜欢的食物： 醉虾、白饭、生鱼片</li><li class=\"\">喜欢的颜色： 深蓝、黑、白</li><li class=\"\" title=\"喜欢的组合： 动力火车、S.H.E、N’Sync\">喜欢的组合： 动力火车、S.H.E、N’Sync</li><li class=\"bg\" title=\"喜欢的女歌手： 张惠妹、陈洁仪、Jennifer Lopez\">喜欢的女歌手： 张惠妹、陈洁仪、Jennifer Lopez</li><li class=\"bg\" title=\"喜欢的男歌手： 张学友、陶喆、周杰伦、Craig David、Michael Jackson\">喜欢的男歌手： 张学友、陶喆、周杰伦、Craig David、Michael Jackson</li><li class=\"\">喜欢的女演员： 深田恭子、章子怡、全智贤</li><li class=\"\" title=\"喜欢的男演员： 周润发、梁朝伟、Nicolas Cage\">喜欢的男演员： 周润发、梁朝伟、Nicolas Cage</li><li class=\"bg\" title=\"喜欢的电影： 《8 Mile》、《Face-off、》《Saving Phvate Ryan》\">喜欢的电影： 《8 Mile》、《Face-off、》《Saving Phvate Ryan》</li><li class=\"bg\" title=\"喜欢的作家： Shakespeare、Charles Dickens\">喜欢的作家： Shakespeare、Charles Dickens</li><li class=\"\">最难忘的经验： 从小就去日本旅游</li><li class=\"\">最开心的事： 当我知道身边有我“爱”的人</li><li class=\"bg\">最讨厌的事： 当我做错事、犯错、被欺骗的感觉</li><li class=\"bg\">擅长的乐器： 钢琴、吉他、鼓</li><li class=\"\">结婚年龄： 35岁之后</li><li class=\"\"></li></ul></div></div>";
    public static String jianjie="<div class=\"content\"><p>林俊杰（JJ Lin），新加坡人，流行歌手、词曲创作者、音乐制作人。2003年以专辑《乐行者》出道。2004年凭《江南》成名。2007年成立音乐制作公司JFJ Productions，负责单曲及专辑制作。2014年荣获第25届台湾金曲奖最佳国语男歌手奖。\n" +
            "林俊杰跨界发展身兼数职，在诸多领域均有所成就：2008年创立潮流品牌SMG；2012年发行故事影像书《记得》，成功跻身畅销书作家行列；2013年以发行专辑《因你而在 Stories Untold》为契机，联手多位名家，以十支风格迥异又相辅相成的微电影，从全新角度完美诠释音乐内涵。2014年，推出首张英文翻唱iTunes Session EP，同步Live录音展现精湛唱功。\n" +
            "除演艺事业外，林俊杰还担任了2008年北京奥运会及2010年新加坡青奥会火炬手，为2010年上海世博会新加坡馆创作并演唱了主题曲《感动每一刻》。 林俊杰亦积极投身慈善公益事业，多次捐款募捐，并亲身探访。2009年，林俊杰因在音乐、慈善公益等方面表现卓越，荣获“新加坡杰出青年奖”。\n" +
            "2013年7月，开启“时线TimeLine世界巡回演唱会”，并将于2014年9月20日举办南京场。</p></div>";
}
